zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_adc.h
/* Definition of channels sampling time information to be inserted into       */
/* channels literals definition.                                              */
#define ADC_CHANNEL_0_SMP   (ADC_SMPR1_REGOFFSET | \
                             (( 0UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP0" \
                                                                            position in register */
#define ADC_CHANNEL_1_SMP   (ADC_SMPR1_REGOFFSET | \
                             (( 3UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP1" \
                                                                            position in register */
#define ADC_CHANNEL_2_SMP   (ADC_SMPR1_REGOFFSET | \
                             (( 6UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP2" \
                                                                            position in register */
#define ADC_CHANNEL_3_SMP   (ADC_SMPR1_REGOFFSET | \
                             (( 9UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP3" \
                                                                            position in register */
#define ADC_CHANNEL_4_SMP   (ADC_SMPR1_REGOFFSET | \
                             ((12UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP4" \
                                                                            position in register */
#define ADC_CHANNEL_5_SMP   (ADC_SMPR1_REGOFFSET | \
                             ((15UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP5" \
                                                                            position in register */
#define ADC_CHANNEL_6_SMP   (ADC_SMPR1_REGOFFSET | \
                             ((18UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP6" \
                                                                            position in register */
#define ADC_CHANNEL_7_SMP   (ADC_SMPR1_REGOFFSET | \
                             ((21UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP7" \
                                                                            position in register */
#define ADC_CHANNEL_8_SMP   (ADC_SMPR1_REGOFFSET | \
                             ((24UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP8" \
                                                                            position in register */
#define ADC_CHANNEL_9_SMP   (ADC_SMPR1_REGOFFSET | \
                             ((27UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR1_SMP9" \
                                                                            position in register */
#define ADC_CHANNEL_10_SMP  (ADC_SMPR2_REGOFFSET | \
                             (( 0UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP10"\
                                                                            position in register */
#define ADC_CHANNEL_11_SMP  (ADC_SMPR2_REGOFFSET | \
                             (( 3UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP11"\
                                                                            position in register */
#define ADC_CHANNEL_12_SMP  (ADC_SMPR2_REGOFFSET | \
                             (( 6UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP12"\
                                                                            position in register */
#define ADC_CHANNEL_13_SMP  (ADC_SMPR2_REGOFFSET | \
                             (( 9UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP13"\
                                                                            position in register */
#define ADC_CHANNEL_14_SMP  (ADC_SMPR2_REGOFFSET | \
                             ((12UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP14"\
                                                                            position in register */
#define ADC_CHANNEL_15_SMP  (ADC_SMPR2_REGOFFSET | \
                             ((15UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP15"\
                                                                            position in register */
#define ADC_CHANNEL_16_SMP  (ADC_SMPR2_REGOFFSET | \
                             ((18UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP16"\
                                                                            position in register */
#define ADC_CHANNEL_17_SMP  (ADC_SMPR2_REGOFFSET | \
                             ((21UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP17"\
                                                                            position in register */
#define ADC_CHANNEL_18_SMP  (ADC_SMPR2_REGOFFSET | \
                             ((24UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP18"\
                                                                            position in register */
#define ADC_CHANNEL_19_SMP  (ADC_SMPR2_REGOFFSET | \
                             ((27UL) << ADC_CHANNEL_SMPx_BITOFFSET_POS)) /* Value shifted is equivalent \
                                                                            to bitfield "ADC_SMPR2_SMP19"\
                                                                            position in register */


/* Internal mask for ADC mode single or differential ended:                   */
/* To select into literals LL_ADC_SINGLE_ENDED or LL_ADC_SINGLE_DIFFERENTIAL  */
/* the relevant bits for:                                                     */
/* (concatenation of multiple bits used in different registers)               */
/* - ADC calibration: calibration start, calibration factor get or set        */
/* - ADC channels: set each ADC channel ending mode                           */
#define ADC_SINGLEDIFF_CALIB_START_MASK    (ADC_CR_ADCALDIF)
#define ADC_SINGLEDIFF_CALIB_FACTOR_MASK   (ADC_CALFACT_CALFACT_D | ADC_CALFACT_CALFACT_S)
#define ADC_SINGLEDIFF_CHANNEL_MASK        (ADC_CHANNEL_ID_BITFIELD_MASK) /* Equivalent to ADC_DIFSEL_DIFSEL */
#define ADC_SINGLEDIFF_CHANNEL_SHIFT_MASK  (ADC_CALFACT_CALFACT_S_4 | \
                                            ADC_CALFACT_CALFACT_S_3) /* Bits chosen to perform of shift when \
                                                                        single mode is selected, shift value out \
                                                                        of channels bits range. */
#define ADC_SINGLEDIFF_CALIB_F_BIT_D_MASK   (0x00010000UL)           /* Selection of 1 bit to discriminate \
                                                                        differential mode: mask of bit */
#define ADC_SINGLEDIFF_CALIB_F_BIT_D_POS    (16UL)                   /* Selection of 1 bit to discriminate \
                                                                        differential mode: position of bit */
#define ADC_SINGLEDIFF_CALIB_F_BIT_D_SHIFT4 (ADC_SINGLEDIFF_CALIB_F_BIT_D_POS - \
                                             4UL) /* Shift of bit ADC_SINGLEDIFF_CALIB_F_BIT_D to position \
                                                     to perform a shift of 4 ranks */

/* Internal mask for ADC analog watchdog:                                     */
/* To select into literals LL_ADC_AWD_CHANNELx_xxx the relevant bits for:     */
/* (concatenation of multiple bits used in different analog watchdogs,        */
/* (feature of several watchdogs not available on all STM32 families)).       */
/* - analog watchdog 1: monitored channel defined by number,                  */
/*   selection of ADC group (ADC groups regular and-or injected).             */
/* - analog watchdog 2 and 3: monitored channel defined by bitfield, no       */
/*   selection on groups.                                                     */

/* Internal register offset for ADC analog watchdog channel configuration */
#define ADC_AWD_CR1_REGOFFSET              (0x00000000UL)
#define ADC_AWD_CR2_REGOFFSET              (0x00100000UL)
#define ADC_AWD_CR3_REGOFFSET              (0x00200000UL)

/* Register offset gap between AWD1 and AWD2-AWD3 configuration registers */
/* (Set separately as ADC_AWD_CRX_REGOFFSET to spare 32 bits space */
#define ADC_AWD_CR12_REGOFFSETGAP_MASK     (ADC_AWD2CR_AWD2CH_0)
#define ADC_AWD_CR12_REGOFFSETGAP_VAL      (0x00000024UL)

#define ADC_AWD_CRX_REGOFFSET_MASK         (ADC_AWD_CR1_REGOFFSET | ADC_AWD_CR2_REGOFFSET | ADC_AWD_CR3_REGOFFSET)

#define ADC_AWD_CR1_CHANNEL_MASK           (ADC_CFGR1_AWD1CH | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)
#define ADC_AWD_CR23_CHANNEL_MASK          (ADC_AWD2CR_AWD2CH)
#define ADC_AWD_CR_ALL_CHANNEL_MASK        (ADC_AWD_CR1_CHANNEL_MASK | ADC_AWD_CR23_CHANNEL_MASK)

#define ADC_AWD_CRX_REGOFFSET_POS          (20UL) /* Position of bits ADC_AWD_CRx_REGOFFSET \
                                                     in ADC_AWD_CRX_REGOFFSET_MASK */

/* Internal register offset for ADC analog watchdog threshold configuration */
#define ADC_AWD_TR1_REGOFFSET              (ADC_AWD_CR1_REGOFFSET)
#define ADC_AWD_TR2_REGOFFSET              (ADC_AWD_CR2_REGOFFSET)
#define ADC_AWD_TR3_REGOFFSET              (ADC_AWD_CR3_REGOFFSET)
#define ADC_AWD_TRX_REGOFFSET_MASK         (ADC_AWD_TR1_REGOFFSET | ADC_AWD_TR2_REGOFFSET | ADC_AWD_TR3_REGOFFSET)
#define ADC_AWD_TRX_REGOFFSET_POS          (ADC_AWD_CRX_REGOFFSET_POS)      /* Position of bits ADC_SQRx_REGOFFSET \
                                                                               in ADC_AWD_TRX_REGOFFSET_MASK */
#define ADC_AWD_TRX_BIT_HIGH_MASK          (0x00010000UL)                   /* Selection of 1 bit to discriminate \
                                                                               threshold high: mask of bit */
#define ADC_AWD_TRX_BIT_HIGH_POS           (16UL)                           /* Selection of 1 bit to discriminate \
                                                                               threshold high: position of bit */
#define ADC_AWD_TRX_BIT_HIGH_SHIFT4        (ADC_AWD_TRX_BIT_HIGH_POS - 4UL) /* Shift of bit ADC_AWD_TRX_BIT_HIGH to \
                                                                               position to perform a shift of 4 ranks */

/* Internal mask for ADC offset:                                              */
/* Internal register offset for ADC offset number configuration */
#define ADC_OFR1_REGOFFSET                 (0x00000000UL)
#define ADC_OFR2_REGOFFSET                 (0x00000001UL)
#define ADC_OFR3_REGOFFSET                 (0x00000002UL)
#define ADC_OFR4_REGOFFSET                 (0x00000003UL)
#define ADC_OFRx_REGOFFSET_MASK            (ADC_OFR1_REGOFFSET | ADC_OFR2_REGOFFSET \
                                            | ADC_OFR3_REGOFFSET | ADC_OFR4_REGOFFSET)


