zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_adc.h
  uint32_t SequencerLength;             /*!< Set ADC group regular sequencer length.
                                             This parameter can be a value of @ref ADC_LL_EC_REG_SEQ_SCAN_LENGTH
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_REG_SetSequencerLength(). */

  uint32_t SequencerDiscont;            /*!< Set ADC group regular sequencer discontinuous mode: sequence subdivided
                                             and scan conversions interrupted every selected number of ranks.
                                             This parameter can be a value of @ref ADC_LL_EC_REG_SEQ_DISCONT_MODE
                                             @note This parameter has an effect only if group regular sequencer is
                                                   enabled (scan length of 2 ranks or more).
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_REG_SetSequencerDiscont(). */

  uint32_t ContinuousMode;              /*!< Set ADC continuous conversion mode on ADC group regular,
                                             whether ADC conversions are performed in single mode (one conversion per
                                             trigger) or in continuous mode (after the first trigger, following
                                             conversions launched successively automatically).
                                             This parameter can be a value of @ref ADC_LL_EC_REG_CONTINUOUS_MODE
                                             Note: It is not possible to enable both ADC group regular continuous
                                                   mode and discontinuous mode.
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_REG_SetContinuousMode(). */

  uint32_t DataTransferMode;            /*!< Set ADC group regular conversion data transfer mode: no transfer,
                                             transfer by DMA (Limited/Unlimited) or MDF.
                                             This parameter can be a value of @ref ADC_LL_EC_REG_DATA_TRANSFER_MODE
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_REG_SetDataTransferMode(). */

  uint32_t Overrun;                     /*!< Set ADC group regular behavior in case of overrun:
                                             data preserved or overwritten.
                                             This parameter can be a value of @ref ADC_LL_EC_REG_OVR_DATA_BEHAVIOR
                                             This feature can be modified afterwards using unitary function
                                             @ref LL_ADC_REG_SetOverrun(). */

} LL_ADC_REG_InitTypeDef;

/**
  * @brief  Structure definition of some features of ADC group injected.
  * @note   These parameters have an impact on ADC scope: ADC group injected.
  *         Refer to corresponding unitary functions into
  *         @ref ADC_LL_EF_Configuration_ADC_Group_Regular
  *         (functions with prefix "INJ").
  * @note   The setting of these parameters by function @ref LL_ADC_INJ_Init()
  *         is conditioned to ADC state:
  *         ADC instance must be disabled.
  *         This condition is applied to all ADC features, for efficiency
  *         and compatibility over all STM32 families. However, the different
  *         features can be set under different ADC state conditions
  *         (setting possible with ADC enabled without conversion on going,
  *         ADC enabled with conversion on going, ...)
  *         Each feature can be updated afterwards with a unitary function
  *         and potentially with ADC in a different state than disabled,
  *         refer to description of each function for setting
  *         conditioned to ADC state.
  */
typedef struct
{
  uint32_t TriggerSource;        /*!< Set ADC group injected conversion trigger source: internal (SW start)
                                      or from external peripheral (timer event, external interrupt line).
                                      This parameter can be a value of @ref ADC_LL_EC_INJ_TRIGGER_SOURCE
                                      @note On this STM32 series, setting trigger source to external trigger
                                            also set trigger polarity to rising edge (default setting for
                                            compatibility with some ADC on other STM32 families having this
                                            setting set by HW default value).
                                            In case of need to modify trigger edge, use function
                                            @ref LL_ADC_INJ_SetTriggerEdge().
                                      This feature can be modified afterwards using unitary function
                                      @ref LL_ADC_INJ_SetTriggerSource(). */

  uint32_t SequencerLength;      /*!< Set ADC group injected sequencer length.
                                      This parameter can be a value of @ref ADC_LL_EC_INJ_SEQ_SCAN_LENGTH
                                      This feature can be modified afterwards using unitary function
                                      @ref LL_ADC_INJ_SetSequencerLength(). */

  uint32_t SequencerDiscont;     /*!< Set ADC group injected sequencer discontinuous mode: sequence subdivided
                                      and scan conversions interrupted every selected number of ranks.
                                      This parameter can be a value of @ref ADC_LL_EC_INJ_SEQ_DISCONT_MODE
                                      @note This parameter has an effect only if group injected sequencer
                                            is enabled (scan length of 2 ranks or more).
                                      This feature can be modified afterwards using unitary function
                                      @ref LL_ADC_INJ_SetSequencerDiscont(). */

