zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_adc.h
  uint32_t TrigAuto;             /*!< Set ADC group injected conversion trigger: independent or from ADC group regular.
                                      This parameter can be a value of @ref ADC_LL_EC_INJ_TRIG_AUTO
                                      Note: This parameter must be set to set to independent trigger if injected
                                            trigger source is set to an external trigger.
                                      This feature can be modified afterwards using unitary function
                                      @ref LL_ADC_INJ_SetTrigAuto(). */

} LL_ADC_INJ_InitTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup ADC_LL_Exported_Constants ADC Exported Constants
  * @{
  */

/** @defgroup ADC_LL_EC_FLAG ADC flags
  * @brief    Flags defines which can be used with LL_ADC_ReadReg function
  * @{
  */
#define LL_ADC_FLAG_ADRDY                  ADC_ISR_ADRDY      /*!< ADC flag ADC instance ready */
#define LL_ADC_FLAG_EOC                    ADC_ISR_EOC        /*!< ADC flag ADC group regular end of unitary conversion */
#define LL_ADC_FLAG_EOS                    ADC_ISR_EOS        /*!< ADC flag ADC group regular end of sequence conversions */
#define LL_ADC_FLAG_OVR                    ADC_ISR_OVR        /*!< ADC flag ADC group regular overrun */
#define LL_ADC_FLAG_EOSMP                  ADC_ISR_EOSMP      /*!< ADC flag ADC group regular end of sampling phase */
#define LL_ADC_FLAG_JEOC                   ADC_ISR_JEOC       /*!< ADC flag ADC group injected end of unitary conversion */
#define LL_ADC_FLAG_JEOS                   ADC_ISR_JEOS       /*!< ADC flag ADC group injected end of sequence conversions */
#define LL_ADC_FLAG_AWD1                   ADC_ISR_AWD1       /*!< ADC flag ADC analog watchdog 1 */
#define LL_ADC_FLAG_AWD2                   ADC_ISR_AWD2       /*!< ADC flag ADC analog watchdog 2 */
#define LL_ADC_FLAG_AWD3                   ADC_ISR_AWD3       /*!< ADC flag ADC analog watchdog 3 */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_IT ADC interruptions for configuration (interruption enable or disable)
  * @brief    IT defines which can be used with LL_ADC_ReadReg and  LL_ADC_WriteReg functions
  * @{
  */
#define LL_ADC_IT_ADRDY                    ADC_IER_ADRDYIE    /*!< ADC interruption ADC instance ready */
#define LL_ADC_IT_EOC                      ADC_IER_EOCIE      /*!< ADC interruption ADC group regular end of unitary conversion */
#define LL_ADC_IT_EOS                      ADC_IER_EOSIE      /*!< ADC interruption ADC group regular end of sequence conversions */
#define LL_ADC_IT_OVR                      ADC_IER_OVRIE      /*!< ADC interruption ADC group regular overrun */
#define LL_ADC_IT_EOSMP                    ADC_IER_EOSMPIE    /*!< ADC interruption ADC group regular end of sampling phase */
#define LL_ADC_IT_JEOC                     ADC_IER_JEOCIE     /*!< ADC interruption ADC group injected end of unitary conversion */
#define LL_ADC_IT_JEOS                     ADC_IER_JEOSIE     /*!< ADC interruption ADC group injected end of sequence conversions */
#define LL_ADC_IT_AWD1                     ADC_IER_AWD1IE     /*!< ADC interruption ADC analog watchdog 1 */
#define LL_ADC_IT_AWD2                     ADC_IER_AWD2IE     /*!< ADC interruption ADC analog watchdog 2 */
#define LL_ADC_IT_AWD3                     ADC_IER_AWD3IE     /*!< ADC interruption ADC analog watchdog 3 */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_REGISTERS  ADC registers compliant with specific purpose
  * @{
  */
/* List of ADC registers intended to be used (most commonly) with             */
/* DMA transfer.                                                              */
/* Refer to function @ref LL_ADC_DMA_GetRegAddr().                            */
#define LL_ADC_DMA_REG_REGULAR_DATA          (0x00000000UL) /*  ADC group regular conversion data register \
                                                                (corresponding to register DR) to be used \
                                                                with ADC configured in independent mode.\
                                                                Without DMA transfer, register accessed by \
                                                                LL function @ref LL_ADC_REG_ReadConversionData32() \
                                                                and other \
                                                                functions @ref LL_ADC_REG_ReadConversionDatax() */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_COMMON_CLOCK_SOURCE  ADC common - Clock source
  * @{
  */
#define LL_ADC_CLOCK_DIV1                  (0x00000000UL)                                        /*!< ADC kernel clock without prescaler (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV2                  (ADC_CCR_PRESC_0)                                     /*!< ADC kernel clock with prescaler division by 2 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV4                  (ADC_CCR_PRESC_1                  )                   /*!< ADC kernel clock with prescaler division by 4 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV6                  (ADC_CCR_PRESC_1 | ADC_CCR_PRESC_0)                   /*!< ADC kernel clock with prescaler division by 6 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV8                  (ADC_CCR_PRESC_2                                    ) /*!< ADC kernel clock with prescaler division by 8 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV10                 (ADC_CCR_PRESC_2                   | ADC_CCR_PRESC_0) /*!< ADC kernel clock with prescaler division by 10 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV12                 (ADC_CCR_PRESC_2 | ADC_CCR_PRESC_1                  ) /*!< ADC kernel clock with prescaler division by 12 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV16                 (ADC_CCR_PRESC_2 | ADC_CCR_PRESC_1 | ADC_CCR_PRESC_0) /*!< ADC kernel clock with prescaler division by 16 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV32                 (ADC_CCR_PRESC_3)                                     /*!< ADC kernel clock with prescaler division by 32 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV64                 (ADC_CCR_PRESC_3 | ADC_CCR_PRESC_0)                   /*!< ADC kernel clock with prescaler division by 64 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV128                (ADC_CCR_PRESC_3 | ADC_CCR_PRESC_1)                   /*!< ADC kernel clock with prescaler division by 128 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */
#define LL_ADC_CLOCK_DIV256                (ADC_CCR_PRESC_3 | ADC_CCR_PRESC_1 | ADC_CCR_PRESC_0) /*!< ADC kernel clock with prescaler division by 256 (depending on clock source selected from RCC, may be synchrone or asynchrone with ADC bus clock) */

#define LL_ADC_CLOCK_CK_ICN_LS_CSU    (0x00000000UL)        /*!< ADC clock source ICN_LS_MCU for ADC12/3 */
#define LL_ADC_CLOCK_KER_ADC12        (0x00000000UL)        /*!< ADC clock source KER_ADC12  for ADC12/3 */
#define LL_ADC_CLOCK_KER_ADC1         (0x00000000UL)        /*!< ADC clock source KER_ADC1   for ADC1    */
#define LL_ADC_CLOCK_KER_ADC2         (0x00000000UL)        /*!< ADC clock source KER_ADC2   for ADC2    */
#define LL_ADC_CLOCK_KER_ADC3         (0x00000000UL)        /*!< ADC clock source KER_ADC3   for ADC3    */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_COMMON_PATH_INTERNAL  ADC common - Measurement path to internal channels
  * @{
  */
/* Note: Other measurement paths to internal channels may be available        */
/*       (connections to other peripherals).                                  */
/*       If they are not listed below, they do not require any specific       */
/*       path enable. In this case, Access to measurement path is done        */
/*       only by selecting the corresponding ADC internal channel.            */
#define LL_ADC_PATH_INTERNAL_NONE          (0x00000000UL)         /*!< ADC measurement paths all disabled */
#define LL_ADC_PATH_INTERNAL_VREFINT       (ADC_CCR_VREFEN)       /*!< ADC measurement path to internal channel VrefInt */
#define LL_ADC_PATH_INTERNAL_VBAT          (ADC_CCR_VBATEN)       /*!< ADC measurement path to internal channel Vbat */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_PATH_INTERNAL  ADC instance - Measurement path to internal channels
  * @{
  */
/* Note: Other measurement paths to internal channels may be available        */
/*       (connections to other peripherals).                                  */
/*       If they are not listed below, they do not require any specific       */
/*       path enable. In this case, Access to measurement path is done        */
/*       only by selecting the corresponding ADC internal channel.            */
#define LL_ADC_PATH_INTERNAL_VDDCORE       (ADC_OR_VDDCOREEN)     /*!< ADC measurement path to internal channel VddCore */
#define LL_ADC_PATH_INTERNAL_VDDCPU        (ADC_OR_VDDCPUEN)      /*!< ADC measurement path to internal channel VddCPU */
#define LL_ADC_PATH_INTERNAL_VDDGPU        (ADC_OR_VDDGPUEN)      /*!< ADC measurement path to internal channel VddGPU */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_RESOLUTION  ADC instance - Resolution
  * @{
  */
#define LL_ADC_RESOLUTION_12B              (0x00000000UL)                      /*!< ADC resolution 12 bits */
#define LL_ADC_RESOLUTION_10B              (                 ADC_CFGR1_RES_0)  /*!< ADC resolution 10 bits */
#define LL_ADC_RESOLUTION_8B               (ADC_CFGR1_RES_1                 )  /*!< ADC resolution  8 bits */
#define LL_ADC_RESOLUTION_6B               (ADC_CFGR1_RES_1 | ADC_CFGR1_RES_0) /*!< ADC resolution  6 bits */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_LEFT_BIT_SHIFT   ADC left Shift
  * @{
  */
#define LL_ADC_LEFT_BIT_SHIFT_NONE  (0x00000000UL)                                                                       /*!< ADC no bit shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_1     (ADC_CFGR2_LSHIFT_0)                                                                 /*!< ADC 1 bit shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_2     (ADC_CFGR2_LSHIFT_1)                                                                 /*!< ADC 2 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_3     (ADC_CFGR2_LSHIFT_1 | ADC_CFGR2_LSHIFT_0)                                            /*!< ADC 3 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_4     (ADC_CFGR2_LSHIFT_2)                                                                 /*!< ADC 4 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_5     (ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_0)                                            /*!< ADC 5 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_6     (ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_1)                                            /*!< ADC 6 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_7     (ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_1 | ADC_CFGR2_LSHIFT_0)                       /*!< ADC 7 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_8     (ADC_CFGR2_LSHIFT_3)                                                                 /*!< ADC 8 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_9     (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_0)                                            /*!< ADC 9 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_10    (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_1)                                            /*!< ADC 10 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_11    (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_1 | ADC_CFGR2_LSHIFT_0)                       /*!< ADC 11 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_12    (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_2)                                            /*!< ADC 12 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_13    (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_0)                       /*!< ADC 13 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_14    (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_1)                       /*!< ADC 14 bits shift left applied on the final ADC conversion data */
#define LL_ADC_LEFT_BIT_SHIFT_15    (ADC_CFGR2_LSHIFT_3 | ADC_CFGR2_LSHIFT_2 | ADC_CFGR2_LSHIFT_1 | ADC_CFGR2_LSHIFT_0)  /*!< ADC 15 bits shift left applied on the final ADC conversion data */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_LP_MODE  ADC instance - Low power mode
  * @{
  */
#define LL_ADC_LP_AUTOWAIT_DISABLE         (0x00000000UL)                      /*!< ADC low power mode auto delay disabled. */
#define LL_ADC_LP_AUTOWAIT_ENABLE          (ADC_CFGR1_AUTDLY)                  /*!< ADC low power mode auto delay enabled: dynamic low power mode, ADC conversions are performed only when necessary (when previous ADC conversion data is read). See description with function @ref LL_ADC_SetLPModeAutoWait(). */
/**
  * @}
  */
/* Definitions for backward compatibility with legacy STM32 series */
#define LL_ADC_LP_MODE_NONE LL_ADC_LP_AUTOWAIT_DISABLE
#define LL_ADC_LP_AUTOWAIT  LL_ADC_LP_AUTOWAIT_ENABLE

